app/Models/Admin/DataPenindakanModel.php

SELECT `data_penindakan_table`.`id`, `data_penindakan_table`.`ukpd_id`, `data_penindakan_table`.`ppns_id`, `data_penindakan_table`.`spt_id`, `data_penindakan_table`.`unit_id`, `data_penindakan_table`.`jenis_penindakan_id`, `data_penindakan_table`.`bap_id`, `data_penindakan_table`.`jenis_pelanggaran_id`, `data_penindakan_table`.`tanggal_pelanggaran`, `data_penindakan_table`.`jam_pelanggaran`, `data_penindakan_table`.`tempat_penyimpanan_id`, `ukpd_table`.`ukpd`, `bap_table`.`nomor_bap`, `bap_table`.`status_bap_id`, `data_kendaraan_table`.`nomor_kendaraan`, `jenis_penindakan_table`.`jenis_penindakan`, `tempat_penyimpanan_table`.`tempat_penyimpanan`, `status_penderekan_table`.`status_penderekan`
FROM `data_penindakan_table`
JOIN `ukpd_table` ON `ukpd_table`.`id` = `data_penindakan_table`.`ukpd_id`
LEFT JOIN `jenis_penindakan_table` ON `jenis_penindakan_table`.`id` = `data_penindakan_table`.`jenis_penindakan_id`
LEFT JOIN `bap_table` ON `bap_table`.`id` = `data_penindakan_table`.`bap_id`
LEFT JOIN `tempat_penyimpanan_table` ON `tempat_penyimpanan_table`.`id` = `data_penindakan_table`.`tempat_penyimpanan_id`
LEFT JOIN `status_penderekan_table` ON `status_penderekan_table`.`id` = `bap_table`.`status_bap_id`
LEFT JOIN `data_kendaraan_table` ON `bap_table`.`id` = `data_kendaraan_table`.`bap_id`
ORDER BY `data_penindakan_table`.`id` desc
---
    public function getDataPenindakanPenderekan()
    {
        return $this->table($this->table)
            ->select('data_penindakan_table.id, data_penindakan_table.ukpd_id, data_penindakan_table.ppns_id, data_penindakan_table.spt_id, data_penindakan_table.unit_id,data_penindakan_table.jenis_penindakan_id,data_penindakan_table.bap_id, data_penindakan_table.jenis_pelanggaran_id,data_penindakan_table.tanggal_pelanggaran, data_penindakan_table.jam_pelanggaran, data_penindakan_table.tempat_penyimpanan_id,
            ukpd_table.ukpd, bap_table.nomor_bap, bap_table.status_bap_id,data_kendaraan_table.nomor_kendaraan, jenis_penindakan_table.jenis_penindakan, tempat_penyimpanan_table.tempat_penyimpanan, status_penderekan_table.status_penderekan')
            ->join('ukpd_table', 'ukpd_table.id = data_penindakan_table.ukpd_id')
            ->join('jenis_penindakan_table', 'jenis_penindakan_table.id = data_penindakan_table.jenis_penindakan_id', 'left')
            ->join('bap_table', 'bap_table.id = data_penindakan_table.bap_id', 'left')
            ->join('tempat_penyimpanan_table', 'tempat_penyimpanan_table.id = data_penindakan_table.tempat_penyimpanan_id', 'left')
            ->join('status_penderekan_table', 'status_penderekan_table.id = bap_table.status_bap_id', 'left')
            ->join('data_kendaraan_table', ' bap_table.id = data_kendaraan_table.bap_id', 'left')
            ->orderBy('data_penindakan_table.id desc')
            ->get()->getResultObject();