app/Models/Admin/TempatPenyimpananModel.php

SELECT `tempat_penyimpanan_table`.`id`, `tempat_penyimpanan_table`.`ukpd_id`, `tempat_penyimpanan_table`.`tempat_penyimpanan`, `tempat_penyimpanan_table`.`link_gmaps`, `ukpd_table`.`ukpd`
FROM `tempat_penyimpanan_table`
JOIN `ukpd_table` ON `ukpd_table`.`id` = `tempat_penyimpanan_table`.`ukpd_id`
ORDER BY `tempat_penyimpanan_table`.`id` desc
---
    public function getTempatPenyimpanan()
    {
        return $this->table($this->table)
            ->select("tempat_penyimpanan_table.id, tempat_penyimpanan_table.ukpd_id, tempat_penyimpanan_table.tempat_penyimpanan,tempat_penyimpanan_table.latitude, tempat_penyimpanan_table.longitude,ukpd_table.ukpd")
            ->orderBy('tempat_penyimpanan_table.id desc')
            ->join('ukpd_table', 'ukpd_table.id = tempat_penyimpanan_table.ukpd_id')
            ->get()->getResultObject();