app/Models/Admin/UkpdModel.php

SELECT *
FROM `ukpd_table`
ORDER BY `id` desc
---
    public function getUkpd()
    {
        return $this->table($this->table)
            ->orderBy('id desc')
            ->get()->getResultObject();