app/Models/Admin/UnitReguModel.php

SELECT `unit_regu_table`.`id`, `unit_regu_table`.`ukpd_id`, `unit_regu_table`.`unit_regu`, `ukpd_table`.`ukpd`
FROM `unit_regu_table`
JOIN `ukpd_table` ON `ukpd_table`.`id` = `unit_regu_table`.`ukpd_id`
ORDER BY `unit_regu_table`.`id` desc
---
    public function getUnit()
    {
        return $this->table($this->table)
            ->select("unit_regu_table.id, unit_regu_table.ukpd_id, unit_regu_table.unit_regu, ukpd_table.ukpd")
            ->orderBy('unit_regu_table.id desc')
            ->join('ukpd_table', 'ukpd_table.id = unit_regu_table.ukpd_id')
            ->get()->getResultObject();